опора(сфера, '2.910.01', m6).
опора(сфера, '2.910.02', m8).
опора(сфера, '3.910.01', m12).
опора(сфера, '3.910.02', m16).

опора(насечка, '2.911.01', m6).
опора(насечка, '2.911.02', m8).
опора(насечка, '3.911.01', m12).

штырь('2.213.01', m6, 6, 8).
штырь('2.213.04', m8, 8, 12).
штырь('3.213.06', m12, 12, 26).

кулачок(резьба, '2.913.05', '30_18', m6, 16).
кулачок(резьба, '2.913.06', '45_22', m8, 20).
кулачок(резьба, '2.913.09', '65_30', m12, 38).

кулачок(призма, '2.913.01', '30_18', 10, 8, 12, 3, 7).
кулачок(призма, '2.913.02', '45_22', 12, 8, 12, 3, 7).
кулачок(призма, '2.913.07', '65_30', 25, 12, 30, 8, 18).

зажим('2.451.01', '45_30', '30_18', 29).
зажим('2.451.02', '60_45', '45_22', 34).
зажим('3.451.01', '60_45', '45_22', 35).
зажим('3.451.02', '90_60', '65_30', 42).

прокладка('2.217.01', '45_30', 1).
прокладка('2.217.07', '45_30', 2).
прокладка('2.217.09', '45_30', 3).
прокладка('2.217.10', '45_30', 5).

прокладка('3.217.01', '60_45', 1).
прокладка('3.217.07', '60_45', 2).
прокладка('3.217.09', '60_45', 3).
прокладка('3.217.10', '60_45', 5).

прокладка('3.107.25', '90_60', 2).
прокладка('3.107.27', '90_60', 3).
прокладка('3.107.28', '90_60', 5).

%заготовка(плоск_чист, неопр).
%заготовка(плоск_черн, неопр).
%заготовка(цил_верт, неопр).

% Пакет прокладок определенного типа и толщины
% Проблема - разный порядок прокладок - разные решения
% (список кодов, количество, типоразмер, толщина пакета)
пакет_прокладок([],0,_,0):-!.
пакет_прокладок(_,_,_,Толщина):-
    Толщина < 0, !, fail.
пакет_прокладок([СписокГ|СписокХ], Количество, Типоразмер, Толщина):-
    прокладка(СписокГ,Типоразмер,H),
    ТолщинаНов is Толщина - H,
    пакет_прокладок(СписокХ, КоличествоНов, Типоразмер, ТолщинаНов),
    Количество is КоличествоНов + 1.

%Подвижная часть
подвижная_часть(ТипПов, D, КодКул, ТипКул, КодУст, Выс):-
    ТипПов = плоск_чист, опора(сфера, КодУст, Dрезьб),
    кулачок(резьба, КодКул, ТипКул, Dрезьб, Выс);

    ТипПов = плоск_черн, опора(насечка, КодУст, Dрезьб),
    кулачок(резьба, КодКул, ТипКул, Dрезьб, Выс);

    ТипПов = перфор, штырь(КодУст, Dрезьб, Dmin, Dmax),
    D>=Dmin, D=<Dmax,
    кулачок(резьба, КодКул, ТипКул, Dрезьб, Выс);

    ТипПов = цил_верт, КодУст = нет,
    кулачок(призма, КодКул, ТипКул, Выс, _, _, Dmin, Dmax),
    D>=Dmin, D=<Dmax;

    ТипПов = цил_гор, КодУст = нет,
    кулачок(призма, КодКул, ТипКул, Выс, Dmin, Dmax, _, _),
    D>=Dmin, D=<Dmax.








